artifacts/merged-4.yml
---
execution:
- concurrency: 100
  hold-for: 5m
  ramp-up: 1m
  scenario: jmx_sample
modules:
  jmeter:
    class: bzt.modules.jmeter.JMeterExecutor
    path: /usr/local/bin/jmeter
    properties:
      jmeter.save.saveservice.autoflush: 'true'
reporting:
- module: status
scenarios:
  jmx_sample:
    script: test-cases/Kajabi-staging-admin.jmx
settings:
  artifacts-dir: ./artifacts
  default-executor: jmeter